sukibaby/PsNee-RP2040/src/MUC.h
// Define the clock speed for the microcontroller
#ifndef F_CPU
#define F_CPU 16000000L
#endif

// Clear the timer count register (TCNT0)
#define TIMER_TCNT_CLEAR            TCNT0   =   0x00             // TCNT0 - Timer/Counter Register, clears the timer count

// Set OCR0A to achieve a 100KHz clock frequency
#define SET_OCROA_DIV               OCR0A   =   159;             // OCR0A – Output Compare Register A, 100KHz clock generation, 0x10011111

// Configure Timer/Counter 0 for CTC mode and enable the clock source
#define SET_TIMER_TCCROA            TCCR0A |=  (1 << WGM01);     // TCCR0A – Timer/Counter Control Register A, enable CTC mode (WGM01)
#define SET_TIMER_TCCROB            TCCR0B |=  (1 << CS00);      // TCCR0B – Timer/Counter Control Register B, set clock source to I/O clock
                                                                 //Waveform Generation Mode, Mode 2 CTC
// Interrupt vector for timer compare match event                                                      
#define CTC_TIMER_VECTOR            TIMER0_COMPA_vect            //interrupt vector for match event, OCR0A comparison and Timer/Counter 0

#include <stdint.h>
#include <stdbool.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/sfr_defs.h>
#include <util/delay.h>

// Global interrupt control settings
#define GLOBAL_INTERRUPT_ENABLE     SREG   |=  (1<<7)           // Set the I-bit (bit 7) in the Status Register to enable global interrupts
#define GLOBAL_INTERRUPT_DISABLE    SREG   &= ~(1<<7)           // Clear the I-bit (bit 7) in the Status Register to disable global interrupts

// Main pin configuration for input and output

// Define the main pins as inputs
#define PIN_DATA_INPUT              DDRB   &= ~(1<<DDB0)       // Set DDRB register to configure PINB0 as input 
#define PIN_WFCK_INPUT              DDRB   &= ~(1<<DDB1)       // Set DDRB register to configure PINB1 as input
#define PIN_SQCK_INPUT              DDRD   &= ~(1<<DDD6)       // Set DDRB register to configure PINB6 as input                   
#define PIN_SUBQ_INPUT              DDRD   &= ~(1<<DDD7)       // Set DDRB register to configure PINB7 as input
                            
// Enable pull-ups and set high on the main pins
#define PIN_DATA_OUTPUT             DDRB   |=  (1<<DDB0)       // Set DDRB register to configure PINB0 as output 
#define PIN_WFCK_OUTPUT             DDRB   |=  (1<<DDB1)       // Set DDRB register to configure PINB1 as output
           
// Define pull-ups and set high at the main pin
#define PIN_DATA_SET                PORTB  |=  (1<<PB0)        // Set PORTB register to make PINB0 high (enable pull-up)
             
// Clear the main pins (set low)
#define PIN_DATA_CLEAR              PORTB  &= ~(1<<PB0)        // Set PORTB register to make PINB0 low                  
#define PIN_WFCK_CLEAR              PORTB  &= ~(1<<PB1)        // Set PORTB register to make PINB1 low
                         
// Read the state of the main input pins
#define PIN_SQCK_READ              (PIND   &   (1<<PIND6))     // Check if the value of PIND6 is high (1)                      
#define PIN_SUBQ_READ              (PIND   &   (1<<PIND7))     // Check if the value of PIND7 is high (1)                      
#define PIN_WFCK_READ              (PINB   &   (1<<PINB1))     // Check if the value of PIND1 is high (1)        

// LED pin handling (for indication)
#define LED_RUN
#define PIN_LED_OUTPUT              DDRB   |=  (1<<DDB5)       // Configure PINB5 as output (for LED)                
#define PIN_LED_ON                  PORTB  |=  (1<<PB5)        // Set PINB5 high (turn on LED)
#define PIN_LED_OFF                 PORTB  &= ~(1<<PB5)        // Set PINB5 low (turn off LED)

// Handling the BIOS patch

// Enable/Disable timer interrupts
#define TIMER_INTERRUPT_ENABLE      TIMSK0 |=  (1<<OCIE0A)     // Enable interrupt on Timer0 Compare Match A
#define TIMER_INTERRUPT_DISABLE     TIMSK0 &= ~(1<<OCIE0A)     // Disable interrupt on Timer0 Compare Match A

// Clear the timer interrupt flag
#define TIMER_TIFR_CLEAR            TIFR0  |=  (1<<OCF0A)      // Clear the Timer0 Compare Match A interrupt flag

// Define input pins for the BIOS patch
#define PIN_AX_INPUT                DDRD   &= ~(1<<DDD2)       // Set DDRD register to configure PIND2 as input
#define PIN_AY_INPUT                DDRD   &= ~(1<<DDD3)       // Set DDRD register to configure PIND3 as input
#define PIN_DX_INPUT                DDRD   &= ~(1<<DDD4)       // Set DDRD register to configure PIND4 as input

// Define output pins for the BIOS patch
#define PIN_DX_OUTPUT               DDRD   |=  (1<<DDD4)       // Set DDRD register to configure PIND4 as output

// Set pull-ups high on output pins
#define PIN_DX_SET                  PORTD  |=  (1<<PD4)       // Set PORTD register to make PIND4 high

// Set pull-ups low on output pins
#define PIN_DX_CLEAR                PORTD  &= ~(1<<PD4)       // Set PORTD register to make PIND4 low

// Read the input pins for the BIOS patch
#define PIN_AX_READ                (PIND   &   (1<<PIND2))    // Read the state of PIND2                     
#define PIN_AY_READ                (PIND   &   (1<<PIND3))                       

// External interrupt configuration for BIOS patch
#define PIN_AX_INTERRUPT_ENABLE     EIMSK  |=  (1<<INT0)      // Enable external interrupt on INT0 (PINB2)
#define PIN_AY_INTERRUPT_ENABLE     EIMSK  |=  (1<<INT1)      // Enable external interrupt on INT1 (PINB3)

#define PIN_AX_INTERRUPT_DISABLE    EIMSK  &= ~(1<<INT0)      // Disable external interrupt on INT0
#define PIN_AY_INTERRUPT_DISABLE    EIMSK  &= ~(1<<INT1)      // Disable external interrupt on INT1

#define PIN_AX_INTERRUPT_RISING     EICRA  |=  (1<<ISC01)|(1<<ISC00)                  // Configure INT0 for rising edge trigger
#define PIN_AY_INTERRUPT_RISING     EICRA  |=  (1<<ISC11)|(1<<ISC10)                  // Configure INT1 for rising edge trigger

#define PIN_AX_INTERRUPT_FALLING   (EICRA   =  (EICRA & ~(1<<ISC00)) | (1<<ISC01))    // Configure INT0 for falling edge trigger
#define PIN_AY_INTERRUPT_FALLING   (EICRA   =  (EICRA & ~(1<<ISC10)) | (1<<ISC11))    // Configure INT1 for falling edge trigger

// Interrupt vectors for external interrupts
#define PIN_AX_INTERRUPT_VECTOR        INT0_vect              // Interrupt vector for INT0 (external interrupt)
#define PIN_AY_INTERRUPT_VECTOR        INT1_vect              // Interrupt vector for INT1 (external interrupt)

// Handle switch input for BIOS patch
#define PIN_SWITCH_INPUT            DDRD   &= ~(1<<DDD5)      // Configure PIND5 as input for switch                      
#define PIN_SWITCH_SET              PORTD  |=  (1<<PD5)       // Set PIND5 high (enable pull-up)            
#define PIN_SWITCH_READ            (PIND   &   (1<<PIND5))    // Read the state of PIND5 (switch input)

#endif


#ifdef ATmega32U4_16U4

#define F_CPU 16000000L
#define SET_OCROA_DIV               OCR0A   =   159;
#define SET_TIMER_TCCROA            TCCR0A |=  (1 << WGM01);
#define SET_TIMER_TCCROB            TCCR0B |=  (1 << CS00);
#define CTC_TIMER_VECTOR            TIMER0_COMPA_vect

#include <stdint.h>
#include <stdbool.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/sfr_defs.h>
#include <util/delay.h>

// Globale interrupt seting
#define GLOBAL_INTERRUPT_ENABLE     SREG   |=  (1<<7)           
#define GLOBAL_INTERRUPT_DISABLE    SREG   &= ~(1<<7)    

#define TIMER_INTERRUPT_ENABLE      TIMSK0 |=  (1<<OCIE0A)
#define TIMER_INTERRUPT_DISABLE     TIMSK0 &= ~(1<<OCIE0A)

// Handling the main pins

// Main pins
#define PIN_DATA_INPUT              DDRB   &= ~(1<<DDB4)        
#define PIN_WFCK_INPUT              DDRB   &= ~(1<<DDB5)       
#define PIN_SQCK_INPUT              DDRD   &= ~(1<<DDD7)                           
#define PIN_SUBQ_INPUT              DDRE   &= ~(1<<DDE6) 
                            
#define PIN_DATA_OUTPUT             DDRB   |=  (1<<DDB4)       
#define PIN_WFCK_OUTPUT             DDRB   |=  (1<<DDB5)     
           
// Define pull-ups and set high at the main pin
#define PIN_DATA_SET                PORTB  |=  (1<<PB4)  
// Define pull-ups set down at the main pin
#define PIN_DATA_CLEAR              PORTB  &= ~(1<<PB4)                        
#define PIN_WFCK_CLEAR              PORTB  &= ~(1<<PB5)                    
// Read the main pins
#define PIN_SQCK_READ              (PIND   &   (1<<PIND7))                       
#define PIN_SUBQ_READ              (PINE   &   (1<<PINE6))                      
#define PIN_WFCK_READ              (PINB   &   (1<<PINB5))                                                       

// Handling and use of the LED pin
#define LED_RUN
#define PIN_LED_OUTPUT              DDRB   |=  (1<<DDB6)                                
#define PIN_LED_ON                  PORTB  |=  (1<<PB6)      
#define PIN_LED_OFF                 PORTB  &= ~(1<<PB6)   

