sukibaby/PsNee-RP2040/src/MUC.h
// Read the main pins
#define PIN_SQCK_READ              (PIND   &   (1<<PIND6))     // Create a mask (1<<6) with the six bit at 1 b00100000,                       
#define PIN_SUBQ_READ              (PIND   &   (1<<PIND7))     // compare the PINB register and the mask with the AND operator, and returns the result, PINB bxx1xxxxx AND mask b00100000 = 1                      
#define PIN_WFCK_READ              (PINB   &   (1<<PINB1))                                                       

// Handling and use of the LED pin
//#define LED_RUN
//#define PIN_LED_OUTPUT              DDRB   |=  (1<<DDB5)                                
//#define PIN_LED_ON                  PORTB  |=  (1<<PB5)      
//#define PIN_LED_OFF                 PORTB  &= ~(1<<PB5)   

// Handling the BIOS patch

// BIOS interrupt seting
#define TIMER_INTERRUPT_ENABLE      TIMSK0 |=  (1<<OCIE0A)
#define TIMER_INTERRUPT_DISABLE     TIMSK0 &= ~(1<<OCIE0A)

// BIOS timer clear
#define TIMER_TIFR_CLEAR            TIFR0  |=  (1<<OCF0A)

// Pins input
#define PIN_AX_INPUT                DDRD   &= ~(1<<DDD2)                            
#define PIN_AY_INPUT                DDRD   &= ~(1<<DDD3)                             
#define PIN_DX_INPUT                DDRD   &= ~(1<<DDD4)                             
// Pin output
#define PIN_DX_OUTPUT               DDRD   |=  (1<<DDD4)                             
// Define pull-ups set high 
#define PIN_DX_SET                  PORTD  |=  (1<<PD4)                              
// Define pull-ups set down 
#define PIN_DX_CLEAR                PORTD  &= ~(1<<PD4)                            
// Read pins for BIOS patch
#define PIN_AX_READ                (PIND   &   (1<<PIND2))                             
#define PIN_AY_READ                (PIND   &   (1<<PIND3))                             

// Handling the external interrupt
#define PIN_AX_INTERRUPT_ENABLE     EIMSK  |=  (1<<INT0)
#define PIN_AY_INTERRUPT_ENABLE     EIMSK  |=  (1<<INT1)

#define PIN_AX_INTERRUPT_DISABLE    EIMSK  &= ~(1<<INT0)
#define PIN_AY_INTERRUPT_DISABLE    EIMSK  &= ~(1<<INT1)

#define PIN_AX_INTERRUPT_RISING     EICRA  |=  (1<<ISC01)|(1<<ISC00)
#define PIN_AY_INTERRUPT_RISING     EICRA  |=  (1<<ISC11)|(1<<ISC10)

#define PIN_AX_INTERRUPT_FALLING   (EICRA   =  (EICRA & ~(1<<ISC00)) | (1<<ISC01))
#define PIN_AY_INTERRUPT_FALLING   (EICRA   =  (EICRA & ~(1<<ISC10)) | (1<<ISC11))

#define PIN_AX_INTERRUPT_VECTOR        INT0_vect              
#define PIN_AY_INTERRUPT_VECTOR        INT1_vect    

// Handling and reading the switch pin for patch BIOS
#define PIN_SWITCH_INPUT            DDRD   &= ~(1<<DDD5)                              
#define PIN_SWITCH_SET              PORTD  |=  (1<<PD5)                                
#define PIN_SWITCH_READ            (PIND   &   (1<<PIND5))

#endif

#ifdef ATtiny214_414

//#define SET_CTRLA
#define DF_CPU 20000000L
#define TIMER_TCNT_CLEAR            TCA0.SINGLE.CNT   =   0x00             //TCNT0 - Timer/Counter Register
#define SET_OCROA_DIV               TCA0.SINGLE.CMP0L   =   100;             //OCR0A – Output Compare Register A, 0x10011111, 100KHz
#define SET_TIMER_TCCROA            TCA0.SINGLE.CTRLB |=  (1 << TCA_SINGLE_WGM0); //TCA_SINGLE_WGMODE_FRQ_gc    //TCCR0A – Timer/Counter Control Register A. turn on CTC mode, CTC0
#define SET_TIMER_TCCROB            TCA0.SINGLE.CTRLA |=  (1 << TCA_SINGLE_CLKSEL0);  //TCA_SINGLE_CLKSEL_DIV1_gc//TCCR0B – Timer/Counter Control Register B,  CS00: Clock Select,  clk I/O
                                                                 //Waveform Generation Mode, Mode 2 CTC
#define CTC_TIMER_VECTOR            TCA0_OVF_vect         //TCA0_CMP0_vect            //interrupt vector for match event, OCR0A comparison and Timer/Counter 0


#include <stdint.h>
#include <stdbool.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/sfr_defs.h>
#include <util/delay.h>

// Globale interrupt seting
#define GLOBAL_INTERRUPT_ENABLE     __asm__ __volatile__ ("sei" ::) //CPU.SREG   |=  (1<<7)           
#define GLOBAL_INTERRUPT_DISABLE    __asm__ __volatile__ ("cli" ::) //CPU.SREG   &= ~(1<<7)    

// Handling the main pins

// Main pins input
#define PIN_DATA_INPUT              PORTA.DIR = PIN2_bm      
#define PIN_WFCK_INPUT              PORTA.DIR = PIN1_bm         // Create a mask (1<<0) with the first bit at 1 b00000001 uses the ~ operator to perform a bit inversion b11111110,
#define PIN_SQCK_INPUT              PORTA.DIR = PIN4_bm         // &= updates the DDRB register with the AND operator and the mask, DDRB bxxxxxxxx OR mask b11111110 = bxxxxxxx0                     
#define PIN_SUBQ_INPUT              PORTA.DIR = PIN3_bm   
                            
// Main pin output
#define PIN_DATA_OUTPUT             PORTA.DIR |= PIN2_bm         // Create a mask (1<<0) with the first bit at 1 b00000001,     
#define PIN_WFCK_OUTPUT             PORTA.DIR |= PIN1_bm         // |= updates the DDRB register with the OR operator and the mask, DDRB bxxxxxxxx OR mask b00000001 = bxxxxxxx1
           
// Define pull-ups and set high at the main pin
#define PIN_DATA_SET                PORTA.OUT |= PIN2_bm         // Create a mask (1<<0) with the first bit at 1 b00000001,
                                                               // |= updates the PORTB register with the OR operator and the mask, PORTB bxxxxxxxx OR mask b00000001 = bxxxxxxx1
             
// Define pull-ups set down at the main pin
#define PIN_DATA_CLEAR              PORTA.OUT &= ~PIN2_bm         // Create a mask (1<<0) with the first bit at 1 b00000001 uses the ~ operator to perform a bit inversion b11111110,                    
#define PIN_WFCK_CLEAR              PORTA.OUT &= ~PIN1_bm         // &= updates the DDRB register with the AND operator and the mask, DDRB bxxxxxxxx OR mask b11111110 = bxxxxxxx0
                         
// Read the main pins
#define PIN_SQCK_READ              PORTA.IN & PIN4_bm     // Create a mask (1<<6) with the six bit at 1 b00100000,                       
#define PIN_SUBQ_READ             PORTA.IN & PIN3_bm     // compare the PINB register and the mask with the AND operator, and returns the result, PINB bxx1xxxxx AND mask b00100000 = 1                      
#define PIN_WFCK_READ              PORTA.IN & PIN1_bm                                                       

// Handling and use of the LED pin
#define LED_RUN
#define PIN_LED_OUTPUT              PORTB.DIR |= PIN2_bm                                
#define PIN_LED_ON                  PORTB.OUT |= PIN2_bm       
#define PIN_LED_OFF                 PORTB.OUT  &= ~PIN2_bm  

