sukibaby/PsNee-RP2040/src/MUC.h
// Handling the BIOS patch

// BIOS interrupt seting
#define TIMER_INTERRUPT_ENABLE      TCA0.SPLIT.INTCTRL |= TCA_SINGLE_CMP0_bm
#define TIMER_INTERRUPT_DISABLE     TCA0.SPLIT.INTCTRL &= ~TCA_SPLIT_HCMP0_bm

// BIOS timer clear
#define TIMER_TIFR_CLEAR            TCA0.SPLIT.INTFLAGS = TCA_SPLIT_HCMP0_bm

// Pins input
#define PIN_AX_INPUT                PORTB.DIR &= ~PIN3_bm                             
#define PIN_AY_INPUT                PORTA.DIR &= ~PIN7_bm                              
#define PIN_DX_INPUT                PORTA.DIR &= ~PIN6_bm                              
// Pin output
#define PIN_DX_OUTPUT               PORTA.DIR |= PIN6_bm                              
// Define pull-ups set high 
#define PIN_DX_SET                  PORTA.OUT |= PIN6_bm                               
// Define pull-ups set down 
#define PIN_DX_CLEAR                PORTA.OUT &= ~PIN6_bm                             
// Read pins for BIOS patch
#define PIN_AX_READ                PORTB.IN & PIN3_bm                            
#define PIN_AY_READ                PORTA.IN & PIN6_bm                              

// Handling the external interrupt
//#define PIN_AX_INTERRUPT_ENABLE     PORTB.PIN3CTRL  |=  (1<<INTn)
//#define PIN_AY_INTERRUPT_ENABLE     PORTA.PIN7CTRL  |=  (1<<INTn)

#define PIN_AX_INTERRUPT_DISABLE    PORTB.PIN3CTRL = PORT_ISC_INTDISABLE_gc
#define PIN_AY_INTERRUPT_DISABLE    PORTA.PIN7CTRL = PORT_ISC_INTDISABLE_gc

#define PIN_AX_INTERRUPT_RISING     PORTB.PIN3CTRL = PORT_ISC_RISING_gc
#define PIN_AY_INTERRUPT_RISING     PORTA.PIN7CTRL = PORT_ISC_RISING_gc

#define PIN_AX_INTERRUPT_FALLING    PORTB.PIN3CTRL = PORT_ISC_FALLING_gc
#define PIN_AY_INTERRUPT_FALLING    PORTA.PIN7CTRL = PORT_ISC_FALLING_gc

//#define PB3_INTERRUPT PORTB.INTFLAGS & PIN3_bm
//#define PA7_INTERRUPT PORTB.INTFLAGS & PIN7_bm

#define PIN_AX_INTERRUPT_VECTOR        PORTB_PORT_vect               
#define PIN_AY_INTERRUPT_VECTOR        PORTA_PORT_vect    

// Handling and reading the switch pin for patch BIOS
#define PIN_SWITCH_INPUT            PORTA.DIR &= ~PIN5_bm                               
#define PIN_SWITCH_SET              PORTA.OUT |= PIN5_bm                                 
#define PIN_SWITCH_READ            PORTA.IN & PIN5_bm 

#endif

#ifdef LGT8F328P

#define F_CPU 32000000L
#define TIMER_TCNT_CLEAR            TCNT0   =   0x00             
#define SET_OCROA_DIV               OCR0A   =   319;             
#define SET_TIMER_TCCROA            TCCR0A |=  (1 << WGM01);     
#define SET_TIMER_TCCROB            TCCR0B |=  (1 << CS00); 
#define CTC_TIMER_VECTOR            TIMER0_COMPA_vect       


#include <stdint.h>
#include <stdbool.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/sfr_defs.h>
#include <util/delay.h>

// Globale interrupt seting
#define GLOBAL_INTERRUPT_ENABLE     SREG   |=  (1<<7)           
#define GLOBAL_INTERRUPT_DISABLE    SREG   &= ~(1<<7)    

// Handling the main pins

// Main pins input
#define PIN_DATA_INPUT              DDRB   &= ~(1<<DDB0)        
#define PIN_WFCK_INPUT              DDRB   &= ~(1<<DDB1)       
#define PIN_SQCK_INPUT              DDRD   &= ~(1<<DDD6)      
#define PIN_SUBQ_INPUT              DDRD   &= ~(1<<DDD7) 
                            
// Main pin output
#define PIN_DATA_OUTPUT             DDRB   |=  (1<<DDB0)       
#define PIN_WFCK_OUTPUT             DDRB   |=  (1<<DDB1)       
           
// Define pull-ups and set high at the main pin
#define PIN_DATA_SET                PORTB  |=  (1<<PB0)        
                                                              
             
// Define pull-ups set down at the main pin
#define PIN_DATA_CLEAR              PORTB  &= ~(1<<PB0)        
#define PIN_WFCK_CLEAR              PORTB  &= ~(1<<PB1)        
                         
// Read the main pins
#define PIN_SQCK_READ              (PIND   &   (1<<PIND6))         
#define PIN_SUBQ_READ              (PIND   &   (1<<PIND7))     
#define PIN_WFCK_READ              (PINB   &   (1<<PINB1))                                                       

// Handling and use of the LED pin
#define LED_RUN
#define PIN_LED_OUTPUT              DDRB   |=  (1<<DDB5)                                
#define PIN_LED_ON                  PORTB  |=  (1<<PB5)      
#define PIN_LED_OFF                 PORTB  &= ~(1<<PB5)   

// Handling the BIOS patch

// BIOS interrupt seting
#define TIMER_INTERRUPT_ENABLE      TIMSK0 |=  (1<<OCIE0A)
#define TIMER_INTERRUPT_DISABLE     TIMSK0 &= ~(1<<OCIE0A)

// BIOS timer clear
#define TIMER_TIFR_CLEAR            TIFR0  |=  (1<<OCF0A)

// Pins input
#define PIN_AX_INPUT                DDRD   &= ~(1<<DDD2)                            
#define PIN_AY_INPUT                DDRD   &= ~(1<<DDD3)                             
#define PIN_DX_INPUT                DDRD   &= ~(1<<DDD4)                             
// Pin output
#define PIN_DX_OUTPUT               DDRD   |=  (1<<DDD4)                             
// Define pull-ups set high 
#define PIN_DX_SET                  PORTD  |=  (1<<PD4)                              
// Define pull-ups set down 
#define PIN_DX_CLEAR                PORTD  &= ~(1<<PD4)                            
// Read pins for BIOS patch
#define PIN_AX_READ                (PIND   &   (1<<PIND2))                             
#define PIN_AY_READ                (PIND   &   (1<<PIND3))                             

// Handling the external interrupt
#define PIN_AX_INTERRUPT_ENABLE     EIMSK  |=  (1<<INT0)
#define PIN_AY_INTERRUPT_ENABLE     EIMSK  |=  (1<<INT1)

#define PIN_AX_INTERRUPT_DISABLE    EIMSK  &= ~(1<<INT0)
#define PIN_AY_INTERRUPT_DISABLE    EIMSK  &= ~(1<<INT1)

#define PIN_AX_INTERRUPT_RISING     EICRA  |=  (1<<ISC01)|(1<<ISC00)
#define PIN_AY_INTERRUPT_RISING     EICRA  |=  (1<<ISC11)|(1<<ISC10)

#define PIN_AX_INTERRUPT_FALLING   (EICRA   =  (EICRA & ~(1<<ISC00)) | (1<<ISC01))
#define PIN_AY_INTERRUPT_FALLING   (EICRA   =  (EICRA & ~(1<<ISC10)) | (1<<ISC11))

#define PIN_AX_INTERRUPT_VECTOR        INT0_vect              
#define PIN_AY_INTERRUPT_VECTOR        INT1_vect    

// Handling and reading the switch pin for patch BIOS
#define PIN_SWITCH_INPUT            DDRD   &= ~(1<<DDD5)                              
#define PIN_SWITCH_SET              PORTD  |=  (1<<PD5)                                
#define PIN_SWITCH_READ            (PIND   &   (1<<PIND5))

#endif

#ifdef CH32V003

#include "ch32v003.h" // Inclure le fichier d'en-tête spécifique au microcontrôleur
#include <stdint.h>
#include <stdbool.h>

