sukibaby/PsNee-RP2040/src/MUC.h
// Fréquence d'horloge
#define F_CPU 8000000L

// Configuration du timer pour une fréquence de 100 kHz
#define TIMER_TCNT_CLEAR            TIM2_CNT = 0x00            // ok Effacer le compteur du Timer 2
#define SET_OCROA_DIV               TIM2_ARR = 79              // not Définir la valeur de comparaison pour générer une interruption à 100 kHz
#define SET_TIMER_TCCROA            TIM2_CR1 |= TIM_CR1_OPM    // notMettre le Timer en mode One Pulse (à adapter selon le mode souhaité)
#define SET_TIMER_TCCROB            TIM2_PSC = 0               // ok Définir le prescaler à 0 pour une fréquence maximale

// Vecteur d'interruption pour le Timer 2
#define CTC_TIMER_VECTOR            TIM2_UP_IRQHandler         // Remplacer par le vecteur d'interruption approprié

// Interruption globale
#define GLOBAL_INTERRUPT_ENABLE     __enable_irq()             
#define GLOBAL_INTERRUPT_DISABLE    __disable_irq()    

// Configuration des broches GPIO
#define PIN_DATA_INPUT              GPIOA->INDR &= ~(GPIO_MODER_MODER0)        
#define PIN_WFCK_INPUT              GPIOA->INDR &= ~(GPIO_MODER_MODER1)       
#define PIN_SQCK_INPUT              GPIOA->INDR &= ~(GPIO_MODER_MODER6)                     
#define PIN_SUBQ_INPUT              GPIOA->INDR &= ~(GPIO_MODER_MODER7) 

#define PIN_DATA_OUTPUT             GPIOA->OUTDR |=  (GPIO_MODER_MODER0_0)       
#define PIN_WFCK_OUTPUT             GPIOA->OUTDR |=  (GPIO_MODER_MODER1_0)       

#define PIN_DATA_SET                GPIOA->BSHR  |=  (GPIO_ODR_ODR_0)     

#define PIN_DATA_CLEAR              GPIOA->BRC  &= ~(GPIO_ODR_ODR_0)                     
#define PIN_WFCK_CLEAR              GPIOA->BRC  &= ~(GPIO_ODR_ODR_1)       

#define PIN_SQCK_READ              (GPIOA->IDR   &   (GPIO_IDR_IDR_6))    
#define PIN_SUBQ_READ              (GPIOA->IDR   &   (GPIO_IDR_IDR_7))                     
#define PIN_WFCK_READ              (GPIOA->IDR   &   (GPIO_IDR_IDR_1))                                                       

// Gestion de la broche LED
#define PIN_LED_OUTPUT              GPIOA->MODER |=  (GPIO_MODER_MODER5_0)                                
#define PIN_LED_ON                  GPIOA->ODR  |=  (GPIO_ODR_ODR_5)      
#define PIN_LED_OFF                 GPIOA->ODR  &= ~(GPIO_ODR_ODR_5)   

// Gestion des interruptions du timer
#define TIMER_INTERRUPT_ENABLE      TIM2_DIER |=  (TIM_DIER_UIE)
#define TIMER_INTERRUPT_DISABLE     TIM2_DIER &= ~(TIM_DIER_UIE)
#define TIMER_TIFR_CLEAR            TIM2_SR   &= ~(TIM_SR_UIF)

// Configuration des broches pour le BIOS
#define PIN_AX_INPUT                GPIOA->MODER &= ~(GPIO_MODER_MODER2)               AFIO_EXTICR             
#define PIN_AY_INPUT                GPIOA->MODER &= ~(GPIO_MODER_MODER3)                             
#define PIN_DX_INPUT                GPIOA->MODER &= ~(GPIO_MODER_MODER4)

#define PIN_DX_OUTPUT               GPIOA->MODER |=  (GPIO_MODER_MODER4_0)  

#define PIN_DX_SET                  GPIOA->ODR  |=  (GPIO_ODR_ODR_4)    

#define PIN_DX_CLEAR                GPIOA->ODR  &= ~(GPIO_ODR_ODR_4)   

#define PIN_AX_READ                (GPIOA->IDR   &   (GPIO_IDR_IDR_2))                             
#define PIN_AY_READ                (GPIOA->IDR   &   (GPIO_IDR_IDR_3))                             

// Gestion des interruptions externes
#define PIN_AX_INTERRUPT_ENABLE     EXTI->IMR  |=  (EXTI_IMR_MR0)               //1<<EXTI_INTENR_MR0
#define PIN_AY_INTERRUPT_ENABLE     EXTI->IMR  |=  (EXTI_IMR_MR1)

#define PIN_AX_INTERRUPT_DISABLE    EXTI->IMR  &= ~(EXTI_IMR_MR0)                 //EXTI_INTENR
#define PIN_AY_INTERRUPT_DISABLE    EXTI->IMR  &= ~(EXTI_IMR_MR1)

#define PIN_AX_INTERRUPT_RISING     EXTI->RTSR |=  (EXTI_RTSR_TR0)               //EXTI_RTENR
#define PIN_AY_INTERRUPT_RISING     EXTI->RTSR |=  (EXTI_RTSR_TR1)

#define PIN_AX_INTERRUPT_FALLING    EXTI->FTSR |=  (EXTI_FTENR_MR0)                  //EXTI_FTENR
#define PIN_AY_INTERRUPT_FALLING    EXTI->FTSR |=  (EXTI_FTENR_MR1)

#define PIN_AX_INTERRUPT_VECTOR     EXTI0_IRQHandler              
#define PIN_AY_INTERRUPT_VECTOR     EXTI1_IRQHandler   

// Gestion de la broche de commutation pour le BIOS
#define PIN_SWITCH_INPUT            GPIOA->MODER &= ~(GPIO_MODER_MODER5)                              
#define PIN_SWITCH_SET              GPIOA->ODR  |=  (GPIO_ODR_ODR_5)                                
#define PIN_SWITCH_READ            (GPIOA->IDR   &   (GPIO_IDR_IDR_5))

#endif

#ifdef ARDUINO_ARCH_RP2040

// Define the clock speed for the RP2040 microcontroller
#ifndef F_CPU
#define F_CPU 133000000L  // RP2040 typically runs at 133MHz
#endif

#include <Arduino.h>
#include <pins_arduino.h>
#include <stdint.h>
#include <stdbool.h>
#if defined(PIN_NEOPIXEL)
#include <Adafruit_NeoPixel.h>
#endif

// Timer related definitions
#define TIMER_TCNT_CLEAR            // No direct timer count register on RP2040 via Arduino
#define SET_OCROA_DIV               // Handled in setup code
#define SET_TIMER_TCCROA            // Handled in setup code
#define SET_TIMER_TCCROB            // Handled in setup code
#define CTC_TIMER_VECTOR            // Handled via attachInterrupt

// Global interrupt control settings
#define GLOBAL_INTERRUPT_ENABLE     interrupts()
#define GLOBAL_INTERRUPT_DISABLE    noInterrupts()

// Define pin numbers for the RP2040 - adjust these to match your wiring
#define PIN_DATA                    2    // GP2
#define PIN_WFCK                    3    // GP3
#define PIN_SQCK                    4    // GP4  
#define PIN_SUBQ                    5    // GP5

// Main pin configuration for input and output
#define PIN_DATA_INPUT              pinMode(PIN_DATA, INPUT)
#define PIN_WFCK_INPUT              pinMode(PIN_WFCK, INPUT)
#define PIN_SQCK_INPUT              pinMode(PIN_SQCK, INPUT)
#define PIN_SUBQ_INPUT              pinMode(PIN_SUBQ, INPUT)
                            
// Output configuration
#define PIN_DATA_OUTPUT             pinMode(PIN_DATA, OUTPUT)
#define PIN_WFCK_OUTPUT             pinMode(PIN_WFCK, OUTPUT)
           
// Setting pins high
#define PIN_DATA_SET                digitalWrite(PIN_DATA, HIGH)
             
// Setting pins low
#define PIN_DATA_CLEAR              digitalWrite(PIN_DATA, LOW)
#define PIN_WFCK_CLEAR              digitalWrite(PIN_WFCK, LOW)
                         
// Reading pin states
#define PIN_SQCK_READ               digitalRead(PIN_SQCK)
#define PIN_SUBQ_READ               digitalRead(PIN_SUBQ)
#define PIN_WFCK_READ               digitalRead(PIN_WFCK)

// Timer interrupt handling
#define TIMER_INTERRUPT_ENABLE      // Handled in code via attachInterrupt
#define TIMER_INTERRUPT_DISABLE     // Handled in code via detachInterrupt
#define TIMER_TIFR_CLEAR            // Not applicable for RP2040

// BIOS patching pins - only needed if using BIOS_PATCH feature
#define PIN_AX                      6    // GP6
#define PIN_AY                      7    // GP7
#define PIN_DX                      8    // GP8
#define PIN_SWITCH                  9    // GP9

// Define input pins for the BIOS patch
#define PIN_AX_INPUT                pinMode(PIN_AX, INPUT)
#define PIN_AY_INPUT                pinMode(PIN_AY, INPUT)
#define PIN_DX_INPUT                pinMode(PIN_DX, INPUT)

