sukibaby/PsNee-RP2040/src/MUC.h
// Define output pins for the BIOS patch
#define PIN_DX_OUTPUT               pinMode(PIN_DX, OUTPUT)

// Set pins high
#define PIN_DX_SET                  digitalWrite(PIN_DX, HIGH)

// Set pins low
#define PIN_DX_CLEAR                digitalWrite(PIN_DX, LOW)

// Read pins
#define PIN_AX_READ                 digitalRead(PIN_AX)
#define PIN_AY_READ                 digitalRead(PIN_AY)

// External interrupt configuration - handled differently on RP2040
#define PIN_AX_INTERRUPT_ENABLE     // Handled in code via attachInterrupt
#define PIN_AY_INTERRUPT_ENABLE     // Handled in code via attachInterrupt
#define PIN_AX_INTERRUPT_DISABLE    // Handled in code via detachInterrupt
#define PIN_AY_INTERRUPT_DISABLE    // Handled in code via detachInterrupt

// Interrupt trigger modes
#define PIN_AX_INTERRUPT_RISING     // Handled in code via attachInterrupt(PIN_AX, ax_isr, RISING)
#define PIN_AY_INTERRUPT_RISING     // Handled in code via attachInterrupt(PIN_AY, ay_isr, RISING)
#define PIN_AX_INTERRUPT_FALLING    // Handled in code via attachInterrupt(PIN_AX, ax_isr, FALLING)
#define PIN_AY_INTERRUPT_FALLING    // Handled in code via attachInterrupt(PIN_AY, ay_isr, FALLING)

// Not used as we're using function pointers
#define PIN_AX_INTERRUPT_VECTOR     // Not applicable for RP2040
#define PIN_AY_INTERRUPT_VECTOR     // Not applicable for RP2040

// Switch input configuration
#define PIN_SWITCH_INPUT            pinMode(PIN_SWITCH, INPUT_PULLUP)
#define PIN_SWITCH_SET              // Not applicable, using INPUT_PULLUP
#define PIN_SWITCH_READ             digitalRead(PIN_SWITCH)

// LED handling for RP2040 boards
#if defined(PIN_NEOPIXEL)
// RP2040 Zero-class boards expose an onboard NeoPixel
Adafruit_NeoPixel pixels(1, PIN_NEOPIXEL, NEO_GRB + NEO_KHZ800);
#define PIN_LED_OUTPUT              do { pixels.begin(); pixels.setBrightness(50); pixels.setPixelColor(0, pixels.Color(0, 0, 0)); pixels.show(); } while (0)
#define PIN_LED_ON                  do { pixels.setPixelColor(0, pixels.Color(0, 255, 0)); pixels.show(); } while (0)
#define PIN_LED_OFF                 do { pixels.setPixelColor(0, pixels.Color(0, 0, 0)); pixels.show(); } while (0)
#else
// Use board variant LED pin from pins_arduino.h (rpipico)
#if defined(PIN_LED)
#define PSNEEPIO_LED_PIN            PIN_LED
#elif defined(LED_BUILTIN)
#define PSNEEPIO_LED_PIN            LED_BUILTIN
#else
#define PSNEEPIO_LED_PIN            25
#endif
#define PIN_LED_OUTPUT              pinMode(PSNEEPIO_LED_PIN, OUTPUT)
#define PIN_LED_ON                  digitalWrite(PSNEEPIO_LED_PIN, HIGH)
#define PIN_LED_OFF                 digitalWrite(PSNEEPIO_LED_PIN, LOW)
#endif

// Arduino-style delay functions for RP2040
#define _delay_us(us) delayMicroseconds(us)
#define _delay_ms(ms) delay(ms)

// Variables for tracking time in RP2040 implementation
unsigned long timer_start_micros = 0;
unsigned long timer_start_millis = 0;
bool timer_running = false;

#endif
